In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df_in = pd.read_csv("income.csv")
df_mo = pd.read_csv("/content/Height_Weight.csv")
df_in.head()

  Index       State    Y2002    Y2003  ...    Y2012    Y2013    Y2014    Y2015
0     A     Alabama  1296530  1317711  ...  1186741  1852841  1558906  1916661
1     A      Alaska  1170302  1960378  ...  1512804  1985302  1580394  1979143
2     A     Arizona  1742027  1968140  ...  1907284  1363279  1525866  1647724
3     A    Arkansas  1485531  1994927  ...  1216675  1591896  1360959  1329341
4     C  California  1685349  1675807  ...  1921845  1156536  1388461  1644607

[5 rows x 16 columns]

In [2]:
df_in.shape

(51, 16)

In [3]:
df_in.describe()

              Y2002         Y2003  ...         Y2014         Y2015
count  5.100000e+01  5.100000e+01  ...  5.100000e+01  5.100000e+01
mean   1.566034e+06  1.509193e+06  ...  1.583360e+06  1.588297e+06
std    2.464425e+05  2.641092e+05  ...  2.601554e+05  2.743807e+05
min    1.111437e+06  1.110625e+06  ...  1.110394e+06  1.110655e+06
25%    1.374180e+06  1.292390e+06  ...  1.385703e+06  1.372523e+06
50%    1.584734e+06  1.485909e+06  ...  1.580394e+06  1.627508e+06
75%    1.776054e+06  1.686698e+06  ...  1.791594e+06  1.848316e+06
max    1.983285e+06  1.994927e+06  ...  1.990412e+06  1.996005e+06

[8 rows x 14 columns]

In [4]:
df_mo.head()

  Index\tHeight(Inches)\tWeight(Pounds)
0                 1\t65.78331\t112.9925
1                 2\t71.51521\t136.4873
2                 3\t69.39874\t153.0269
3                  4\t68.2166\t142.3354
4                 5\t67.78781\t144.2971

## 3 -Tidying messy datasets

In [5]:
## Dataset use for this Data Analysis
df = df_in.iloc[:, 0:10]
df.head()

  Index       State    Y2002    Y2003  ...    Y2006    Y2007    Y2008    Y2009
0     A     Alabama  1296530  1317711  ...  1107408  1440134  1945229  1944173
1     A      Alaska  1170302  1960378  ...  1861639  1465841  1551826  1436541
2     A     Arizona  1742027  1968140  ...  1102568  1109382  1752886  1554330
3     A    Arkansas  1485531  1994927  ...  1669191  1801213  1188104  1628980
4     C  California  1685349  1675807  ...  1735069  1812546  1487315  1663809

[5 rows x 10 columns]

### 3.1 Column headers are values, not variable names

In [6]:
df.head()

  Index       State    Y2002    Y2003  ...    Y2006    Y2007    Y2008    Y2009
0     A     Alabama  1296530  1317711  ...  1107408  1440134  1945229  1944173
1     A      Alaska  1170302  1960378  ...  1861639  1465841  1551826  1436541
2     A     Arizona  1742027  1968140  ...  1102568  1109382  1752886  1554330
3     A    Arkansas  1485531  1994927  ...  1669191  1801213  1188104  1628980
4     C  California  1685349  1675807  ...  1735069  1812546  1487315  1663809

[5 rows x 10 columns]

In [7]:
df_1 = pd.DataFrame()
df_1['Year'] = list(df.columns[2:])
df_1['State'] = df.iloc[0,1]
df_1['Income'] = list(df.iloc[0, 2:])
df_1 = df_1[['State', 'Year', 'Income']]
df_1

     State   Year   Income
0  Alabama  Y2002  1296530
1  Alabama  Y2003  1317711
2  Alabama  Y2004  1118631
3  Alabama  Y2005  1492583
4  Alabama  Y2006  1107408
5  Alabama  Y2007  1440134
6  Alabama  Y2008  1945229
7  Alabama  Y2009  1944173

### 3.2 Multiple variables stored in one column OR
 Creating separate entity of name of columns

In [8]:
from re import findall

year = []
for i in range(0, len(df.columns[2:])):
  
  se = findall('[0-9]+' , df.columns[2:][i])
  year.append(se[0])
print(year)

['2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009']

In [9]:
df.head()

  Index       State    Y2002    Y2003  ...    Y2006    Y2007    Y2008    Y2009
0     A     Alabama  1296530  1317711  ...  1107408  1440134  1945229  1944173
1     A      Alaska  1170302  1960378  ...  1861639  1465841  1551826  1436541
2     A     Arizona  1742027  1968140  ...  1102568  1109382  1752886  1554330
3     A    Arkansas  1485531  1994927  ...  1669191  1801213  1188104  1628980
4     C  California  1685349  1675807  ...  1735069  1812546  1487315  1663809

[5 rows x 10 columns]

In [10]:
df_2 = pd.DataFrame()
df_2['year'] = year

In [11]:
df.iloc[:,0][0:10]

0    A
1    A
2    A
3    A
4    C
5    C
6    C
7    D
8    D
9    F
Name: Index, dtype: object

In [12]:
df_2['State'] = df.iloc[0,1]
df_2['Income'] = list(df.iloc[0, 2:])
df_2.index = df.iloc[:,0][0:8]
df_2 = df_2[['State', 'year', 'Income']]

In [ ]:
df_2

### 3.3 Variables are stored in both rows and columns

In [14]:
df_mo = pd.read_csv("/content/Height_Weight.csv")
df_mo.head()

  Index\tHeight(Inches)\tWeight(Pounds)
0                 1\t65.78331\t112.9925
1                 2\t71.51521\t136.4873
2                 3\t69.39874\t153.0269
3                  4\t68.2166\t142.3354
4                 5\t67.78781\t144.2971

In [15]:
df_mo = pd.read_csv("/content/Height_Weight.csv", sep='\t')
df_mo.head()

   Index  Height(Inches)  Weight(Pounds)
0      1        65.78331        112.9925
1      2        71.51521        136.4873
2      3        69.39874        153.0269
3      4        68.21660        142.3354
4      5        67.78781        144.2971